#pragma once

#include "obf.h"
#include "condition_code.h"

// Ok so the basic idea behind this is that we move all the registers out into a structure somewhere in memory
// The vm is protected by a spinlock like themida until i figure out tls stuff.
// All instructions are transformed from their original iform into one that uses exclusively some "internal registers"
// 
// 
// 	General structure:
//		
//		rdi: vm control structure(vmcs) and saved registers, opcode table immediately follows
//		rsi: virtual instruction pointer
//		rsp: points to place inside vmcs where flags are stored during prologue and epilogue
//		rax,rcx: internal registers used in calculations
//		rcx: reserved for internal shift operations
//		
// 
// Imagine the instruction:
//	
//		add r11,r12
// 
//	The virtual instruction using the internal registers is:
// 
//		add rax,rbx
// 
//	So we need both a prologue and epilogue where the stored r11 and r12 and moved into the internal registers.
//	For this example it would look something like this:
// 
//		ViLoadVirtReg64:
//			mov rax,[rdi+vmcs.r11]
//		ViLoadVirtReg64:
//			mov rbx,[rdi+vmcs.r12]
//		ViLoadNativeFlags:	// This can be skipped if the instruction doesnt modify flags
//			popfq
//		ViAddQ
//			add rax,rbx
//		ViStoreNativeFlags:
//			pushfq
//		ViStoreVirtReg64:
//			mov [rdi+vmcs.r11],rax
// 
//	A total of 6 virtual instructions for this one x86 instruction.
//			
//	
//	vm_enter:
//		acquire_vmcs_spinlock
// 
//		mov [vmcs.a],rax			; probably randomize the order of these to break basic pattern?
//		mov ...
//		mov [vmcs.r15],r15
//		
//		lea rsp,[vmcs.flags]		; load flag storage into rsp
//		pushfq						; store the native flags
//		lea rdi,[vmcs]				; load vmcs into rdi
//		
//		lea rsi,[vip]
//		jmp qword ptr[rdi+rsi*4+sizeof(vmcs)]
//

enum vm_operand_size_t : uint8_t { b8, b16, b32, b64, opsize_max };
enum vm_ireg_t : uint8_t { ireg1, ireg2, ireg3, ireg_max };

uint32_t vm_opsize_to_xed_opsize_map[4] = { 8, 16, 32, 64 };
register_width vm_opsize_to_register_width_map[4] = { register_width::byte, register_width::word, register_width::dword, register_width::qword };

constexpr uint32_t link_code_matrix_size = vm_ireg_t::ireg_max * vm_operand_size_t::opsize_max;

enum vm_iclass_t : uint16_t
{
	vm_enter,
	vm_exit,
	load_reg,
	store_reg,
	load_mem_b,
	store_mem_b,
	load_mem_bd,
	store_mem_bd,
	load_mem_bisd,
	store_mem_bisd,
	load_imm,

};

#define link_code_define(_IClass) _IClass##_start, _IClass##_end = _IClass##_start + link_code_matrix_size - 1,

enum vm_link_code_t : uint32_t
{
	link_code_define(load_reg)
	link_code_define(store_reg)
	link_code_define(load_mem_b)
	link_code_define(store_mem_b)
	link_code_define(load_mem_bd)
	link_code_define(store_mem_bd)
	link_code_define(load_mem_bisd)
	link_code_define(store_mem_bisd)
	link_code_define(load_imm)
	vm_link_code_max
};

#define link_code(_IClass, _IReg, _OpSize) (vm_link_code_t::##_IClass##_start + (_IReg * vm_operand_size_t::opsize_max) + _OpSize)


// Despite this packing, everything has specific alignments.
// Instructions are aligned on 2 byte boundary to make sure access to opcodes is fine
// Displacements within instructions are aligned to 4 byte boundary.
//
#pragma pack(push,1)

template<addr_width::type aw = addr_width::x64>
struct vmcs_t
{
	uint64_t spinlock;
	uint64_t flags;

	//addr_width::storage<aw>::type register_file[18];
	addr_width::storage<aw>::type a, b, c, d, sp, bp, si, di,
		r8, r9, r10, r11, r12, r13, r14, r15, ip, pad;
	//uint32_t handler_table[1];
};
static_assert(sizeof(vmcs_t<addr_width::x64>) % 8 == 0 && sizeof(vmcs_t<addr_width::x86>) % 8 == 0);

#define vmcs_register_file(_Addr_width) offsetof(vmcs_t<_Addr_width>, a)
#define vmcs_handler_table(_Addr_width) sizeof(vmcs_t<_Addr_width>)

// Here are the 8 different possible instruction encodings.
// ranging from 2 to 16 bytes in size
//
namespace vinst_format
{
	struct nothing_t
	{
		uint16_t opcode;
	};
	static_assert(sizeof(nothing_t) % 2 == 0);

	struct reg_t
	{
		uint16_t opcode;
		uint8_t reg1;
		uint8_t pad;
	};
	static_assert(sizeof(reg_t) % 2 == 0);

	struct reg_disp_t
	{
		uint16_t opcode;
		uint8_t reg1;
		uint8_t pad;
		int32_t disp;
	};
	static_assert(sizeof(reg_disp_t) % 2 == 0);
	static_assert(offsetof(reg_disp_t, disp) % 4 == 0);

	struct reg_reg_scale_disp_t
	{
		uint16_t opcode;
		uint8_t reg1;
		uint8_t reg2;
		uint8_t scale;
		uint8_t pad[3];
		int32_t disp;
	};
	static_assert(sizeof(reg_reg_scale_disp_t) % 2 == 0);
	static_assert(offsetof(reg_reg_scale_disp_t, disp) % 4 == 0);

	struct imm8_t
	{
		uint16_t opcode;
		uint8_t pad;
		union { uint8_t imm; int8_t simm; };
	};
	static_assert(sizeof(imm8_t) % 2 == 0);

	struct imm16_t
	{
		uint16_t opcode;
		union { uint16_t imm; int16_t simm; };
	};
	static_assert(sizeof(imm16_t) % 2 == 0);
	static_assert(offsetof(imm16_t, imm) % 2 == 0);

	struct imm32_t
	{
		uint16_t opcode;
		uint16_t pad;
		union { uint32_t imm; int32_t simm; };
	};
	static_assert(sizeof(imm32_t) % 2 == 0);
	static_assert(offsetof(imm32_t, imm) % 4 == 0);

	struct imm64_t
	{
		uint16_t opcode;
		uint16_t pad[3];
		union { uint64_t imm; int64_t simm; };
	};
	static_assert(sizeof(imm64_t) % 2 == 0);
	static_assert(offsetof(imm64_t, imm) % 8 == 0);

}
#pragma pack(pop)


template<addr_width::type aw = addr_width::x64>
struct virtual_operands_t
{
	// All register sizes are the max for the addr_width that pass is invoked with.
	//

	//inline static uint32_t 

	// This is the global handler list that holds ALL handlers within.
	// It is slowly filled as more handlers are discovered and used.
	inline static dasm::inst_list_t<aw> handler_insts;

	inline static dasm::linker_t vm_linker = { 0 };

	inline static xed_reg_enum_t vmcs_reg, vip_reg;

	inline static xed_reg_enum_t iregs[vm_ireg_t::ireg_max];

	inline static constexpr uint32_t free_reg_count = addr_width::register_count<aw>::value - (vm_ireg_t::ireg_max + 1/*rsp*/ + 1/*rdi*/ + 1/*rsi*/);
	inline static xed_reg_enum_t free_regs[free_reg_count];

	// These are the links to the virtual operand table.
	//
	inline static uint32_t virtual_operand_handler_link_table[vm_link_code_max] = { dasm::linker_t::invalid_link_value };

	struct inst_flag_t
	{
		inline static constexpr uint16_t none = 0;

		inline static constexpr uint16_t native = (1 << 1);

		inline static constexpr uint16_t virt = (1 << 2);

		// Calc the displacement from rip to target a and put in disp
		//
		inline static constexpr uint16_t disp = (1 << 3);

	};

#pragma pack(push,1)
	struct inst_t
	{
		uint16_t iclass;
		uint16_t flags;
		uint32_t length;
		uint32_t my_link;
		uint32_t used_link;
		union
		{
			vinst_format::nothing_t no_operands;
			vinst_format::reg_t reg;
			vinst_format::reg_disp_t reg_disp;
			vinst_format::reg_reg_scale_disp_t reg_reg_scale_disp;
			vinst_format::imm8_t imm8;
			vinst_format::imm16_t imm16;
			vinst_format::imm32_t imm32;
			vinst_format::imm64_t imm64;

			struct
			{
				uint8_t operand_count;
				register_width widths[vm_ireg_t::ireg_max];
			}native;
		}fmt;
		union
		{
			struct
			{
				vm_ireg_t ireg;
				vm_operand_size_t opsize;
			}virt;
			struct
			{

			}native;
		}edata;
	};
	static_assert(offsetof(inst_t, fmt.no_operands) == 0x10);
	static_assert(offsetof(inst_t, fmt.reg) == 0x10);
	static_assert(offsetof(inst_t, fmt.reg_disp) == 0x10);
	static_assert(offsetof(inst_t, fmt.reg_reg_scale_disp) == 0x10);
	static_assert(offsetof(inst_t, fmt.imm8) == 0x10);
	static_assert(offsetof(inst_t, fmt.imm16) == 0x10);
	static_assert(offsetof(inst_t, fmt.imm32) == 0x10);
	static_assert(offsetof(inst_t, fmt.imm64) == 0x10);
	//static_assert(sizeof(inst_t) == 0x20);
#pragma pack(pop)


	class block_t
	{
	public:
		std::list<inst_t> insts;

		std::list<block_t>::iterator fallthrough_block, taken_block;

		dasm::termination_type_t termination_type;
	};

	class routine_t
	{
	public:
		std::list<block_t> blocks;
	};


	/*uint32_t encode_inst(inst_t* inst, uint8_t* dest, obf::data_chunk_t<)
	{
		if (inst.flags & inst_flag_t::disp)
		{
			if (inst.type == vm_iclass_t::load_mem_bd || inst.type == vm_iclass_t::store_mem_bd)
			{
				inst.format.reg_disp.disp = static_cast<int32_t>(static_cast<int64_t>(vm_linker.get_link_addr(inst.used_link)) - static_cast<int64_t>(vm_linker.get_link_addr(inst.my_link)));
			}
			else if (inst.type == vm_iclass_t::load_mem_bisd || inst.type == vm_iclass_t::store_mem_bisd)
			{
				inst.format.reg_reg_scale_disp.disp = static_cast<int32_t>(static_cast<int64_t>(vm_linker.get_link_addr(inst.used_link)) - static_cast<int64_t>(vm_linker.get_link_addr(inst.my_link)));
			}
